{
  "NAVBAR": {
    "ABOUT": "About me",
    "SKILLS": "Skills",
    "PROJECTS": "Projects"
  },

  "START-BTNS": {
    "WORK": "Check my work",
    "CONTACT": "Contact me"
  },

  "MARQUEE": {
    "ITEMS": [
      "Available for remote work",
      "Frontend Developer",
      "Based in Munich",
      "Open to work"
    ]
  },

  "ABOUT": {
    "WHO_I_AM": "Who I am",
    "HEADER": "About me",
    "DESCRIPTION": "Hey there, I'm Alex! I’m an IT Process Specialist with experience in project management and technical support. I’m passionate about coding because it allows me to solve problems efficiently for automate processes.",
    "LOCATION": "I'm based in Munich. I am flexible regarding the work environment. I can work in a mobile office or remotely.",
    "MOTIVATION": "Staying curious and adaptable keeps me motivated to constantly improve my coding and IT skills.",
    "PROBLEM_SOLVING": "My problem-solving approach combines analytical thinking, creativity, persistence, and collaboration to find practical and elegant ways to make IT operations more efficient."
  },

  "SKILLS": {
    "TITLE": "Technologies",
    "SUBTITLE": "Skill Set",
    "DESCRIPTION": "I have hands-on experience with frontend technologies including HTML, CSS, JavaScript, Angular, Firebase, Git, and working with REST APIs. I enjoy building responsive and user-friendly interfaces while continuously exploring new tools and frameworks. Staying up-to-date with the fast-evolving world of web development motivates me to learn and adapt quickly.",
    "ANOTHER_SKILL_PART1": "You need",
    "ANOTHER_SKILL_PART2": "another skill?",
    "CONTACT_HINT": "Feel free to contact me. I look forward to expanding on my previous knowledge.",
    "BUTTON": "Let’s Talk"
  },

  "PORTFOLIO": {
    "TITLE": "Portfolio",
    "HEADER": "Featured Projects",
    "DESCRIPTION_PART1": "Explore a selection of my work here - Interact with",
    "DESCRIPTION_PART2": "projects to see my skills in action."
  },

  "REFERENCES": {
    "HEADLINE": "What my colleagues say about me",
    "COMMENTS": [
      {
        "text": "Working with Alex was a truly positive experience. He is reliable, proactive, and contributes valuable ideas that improve every project.",
        "author": "C. Viorell - Team Partner"
      },
      {
        "text": "Alex is a dedicated, solution-oriented team player, and working with him on our web-based business app was always enjoyable and productive. I would gladly collaborate with him again anytime.",
        "author": "B. Bardon - Team Partner"
      },
      {
        "text": "I had the good fortune of working with Alex in a group project at the Developer Akademie that involved a lot of effort. He always stayed calm, cool, and focused, and made sure our team was set up for success.",
        "author": "N. Loukataris - Team Partner"
      }
    ]
  },

  "CONTACT": {
    "HEADLINE": "Contact me",
    "TITLE": "Let´s work together",
    "SUBTITLE": "Got a problem to solve?",
    "DESCRIPTION": "Let’s create something great together! I’m eager to bring my expertise technology to your projects.",
    "QUESTION_PART1": "Need a Frontend delevoper?",
    "QUESTION_PART2": "Let´s talk!",
    "CONTACT_FROM_NAME": "What´s your name?",
    "CONTACT_FROM_NAME_PLACEHOLDER": "Your name goes here?",
    "CONTACT_FROM_NAME_ERROR_MESSAGE": "Oops! It seems your name is missing.",
    "CONTACT_FROM_EMAIL": "What´s your email?",
    "CONTACT_FROM_EMAIL_PLACEHOLDER": "youremail@emial.com",
    "CONTACT_FROM_EMAIL_ERROR_MESSAGE": "Hoopla! Your email is required.",
    "CONTACT_FROM_MESSAGE": "How can I help you?",
    "CONTACT_FROM_MESSAGE_PLACEHOLDER": "Hello Alex, I am interested in...",
    "CONTACT_FROM_MESSAGE_ERROR_MESSAGE": "What do you need to develop?",
    "PRIVACY_POLICE_PART1": "I've read the",
    "PRIVACY_POLICE_PART2": "privacy-police",
    "PRIVACY_POLICE_PART3": " and agree to the processing of my data as outlined.",
    "PRIVACY_POLICE_ERROR_MESSAGE": "Please accept the privacy policy.",
    "BUTTON": "Say Hello ;)"
  },

  "PROJECT": {
    "HEADLINE": "What is this project about?",
    "NEXT": "next project",
    "DESCRIPTION": [
      {
        "text": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories."
      },
      {
        "text": "Jump, run and throw game based on object-oriented approach. Help Pepe to find coins and tabasco salsa to fight against the crazy hen."
      },
      {
        "text": "This interactive Pokédex, built with HTML, CSS, and JavaScript, pulls data from an API to display each Pokémon’s name, image, and type."
      }
    ]
  },

  "FOOTER": {
    "LOCATION": "Munich Germany",
    "IMPRINT": "Legal Notice"
  },

  "IMPRINT": {
    "HEADLINE": "Legal Notice",
    "TITLE": "Imprint",
    "SECTION_CONTACT": "Exploring the board",
    
    "ACCEPTANCE_TITLE": "Acceptance of terms",
    "ACCEPTANCE_TEXT1": "By accessing and using",
  
    "PRODUCT_NAME": "Portfolio",
  
    "ACCEPTANCE_TEXT2": "you acknowledge and agree to the following terms and conditions, including any updates that may be provided to you from time to time without prior notice.",
  
    "SCOPE_TITLE": "Scope and ownership of the product",
    "SCOPE_TEXT1": "as been developed as part of a student group project in a web development bootcamp at the",
    "SCOPE_TEXT2": "It has an educational purpose and is not intended for extensive personal & business usage. As such, we cannot guarantee consistent availability, reliability, accuracy, or any other aspect of quality regarding this Product",
    "SCOPE_TEXT3": "\n\nThe design of", 
    "SCOPE_TEXT4": "is owned by",  
    "SCOPE_TEXT5": "Unauthorized use, reproduction, modification, distribution, or replication of the design is strictly prohibited.",
  
    "PROPRIETARY_TITLE": "Proprietary rights",
    "PROPRIETARY_TEXT1": "Aside from the design owned by the",
    "PROPRIETARY_TEXT2": " we, the listed students, we retain all proprietary rights in",
    "PROPRIETARY_TEXT3": ", including any copyrighted material, trademarks, and other proprietary information.",
  
    "USAGE_TITLE": "Use of the product",
    "USAGE_TEXT1": "is intended to be used for lawful purpose only, in accordance with all applicable laws and regulations. Any use of ",
    "USAGE_TEXT2": "for illegal activities, or to harass, harm, threaten, or intimidate another person, is strictly prohibited. You are solely responsible for your interactions with other users of",
  
    "DISCLAIMER_TITLE": "Disclaimer of warranties and limitation of liability",
    "DISCLAIMER_TEXT1": "is provided \"as is\" without warranty of any kind, whether express or implied, including but not limited to the implied warranties of merchantability, fitness for a particular purpose, and non-infringement. In no event will we, the listed students, or the",
    "DISCLAIMER_TEXT2": "be liable for any direct, indirect, incidental, special, consequential or exemplary damages, including but not limited to, damages for loss of profits, goodwill, use, data, or other intangible losses, even if we have been advised of the possibility of such damages, arising out of or in connection with the use or performance of",

    "INDEMNITY_TITLE": "Indemnity",
    "INDEMNITY_TEXT1": "You agree to indemnify, defend and hold harmless us, the listed students, the ",
    "INDEMNITY_TEXT2": "and our affiliates, partners, officers, directors, agents, and employees, from and against any claim, demand, loss, damage, cost, or liability (including reasonable legal fees) arising out of or relating to your use of Portfolio and/or your breach of this Legal Notice.",
    "INDEMNITY_TEXT3": "For any questions or notices, please contact us at",
    "INDEMNITY_TEXT4": "Date: October "
  }
}
